Web_Ruby_On_Rails/app/views/order_notifier/received.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = ?  [["order_id", 980190963]]
---
		<tbody>
			<% @order.line_items.each do |line_item| %>