Web_Ruby_On_Rails/app/controllers/line_items_controller.rb

  def create

    @cart = current_cart
    product = Product.find(params[:product_id])
    # build is alias of new
    # won't "create" a record in database, just create a new object in memory so that the view can take this object and display something, especially for a form.
    # not to trust param. Instead, verify it by finding in db at first.
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 207281424]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-11-18 20:53:07.261487"], ["updated_at", "2015-11-18 20:53:07.261487"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 207281424], ["cart_id", 980190963], ["created_at", "2015-11-18 20:53:07.262287"], ["updated_at", "2015-11-18 20:53:07.262287"]]