Web_Ruby_On_Rails/app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders"  ORDER BY "orders"."created_at" DESC LIMIT 10 OFFSET 0
---
  def index
    @orders = Order.paginate(page: params[:page], per_page: 10).order(created_at: :desc)

SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 980190963]]
---
  def new
    @cart = current_cart
    if @cart.line_items.count == 0

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-11-21 20:43:47.253077"], ["updated_at", "2015-11-21 20:43:47.253077"]]
INSERT INTO "orders" ("name", "address", "phone", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 980190963]]
---
  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])