Web_Ruby_On_Rails/app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    respond_to do |format|
      if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 980190962]]
UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "sam"], ["password_digest", "$2a$04$cjk4cTNso3JbU.ebRajSvOJ3dxHUWZhP2PLn821nWU1.OmoVolmji"], ["updated_at", "2015-11-22 05:08:30.523507"], ["id", 980190962]]

  def destroy
    begin
      @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 980190962]]